# brew bundle
#   brew bundle cleanup --force

### taps (casks at bottom)
tap 'homebrew/bundle'
tap 'homebrew/core'
tap 'homebrew/services'

### brews
brew 'aspell'
brew 'autoconf'
brew 'autojump'
brew 'base64'
brew 'bison'
brew 'boost'
brew 'cmake'
brew 'curl'
brew 'ffmpeg', args: ['with-libvpx', 'with-libvorbis']
brew 'flac'
brew 'flex'
brew 'freetype'
brew 'fzf'
brew 'gdb'
brew 'gdbm'
brew 'gh'
brew 'gist'
brew 'git'
brew 'gnu-sed'
brew 'gpg'
brew 'id3lib'
brew 'imagemagick'
brew 'jless'
brew 'jpeg'
brew 'jq'
brew 'libogg'
brew 'libpng'
brew 'libtiff'
brew 'libtool'
brew 'libvorbis'
brew 'libyaml'
brew 'llvm'
brew 'lastpass-cli'
brew 'neovim'
brew 'nvm'
brew 'openssl'
brew 'p7zip'
brew 'pcre'
brew 'pgcli'
brew 'pkg-config'
brew 'postgresql@14'
brew 'python'
brew 'readline'
brew 'rename'
brew 'restic'
brew 'ripgrep'
brew 'tree'
brew 'up'
brew 'wget'
brew 'xz'
brew 'yamllint'
brew 'zlib'
brew 'zsh'

### casks (taps at top)
cask 'audacity'
cask 'authy'
cask 'backblaze'
cask 'balenaetcher'
cask 'dbeaver-community'
cask 'deluge'
cask 'docker'
cask 'firefox'
cask 'google-chrome'
cask 'iterm2'
cask 'lastpass'
cask 'osirix-quicklook'
cask 'rar'
cask 'rectangle'
cask 'sketch'
cask 'vlc'
cask 'zoom'
