# brew bundle

# taps (casks at bottom)
tap 'caskroom/cask'
tap 'homebrew/bundle'
tap 'homebrew/core'
tap 'homebrew/services'

# brews
brew 'ack'
brew 'boost'
brew 'cmake'
brew 'curl'
brew 'ffmpeg', args: ['with-libvpx', 'with-libvorbis']
brew 'flac'
brew 'freetype'
brew 'gdb'
brew 'gdbm'
brew 'gist'
brew 'git'
brew 'gpg'
brew 'hub'
brew 'hledger'
brew 'imagemagick'
brew 'jpeg'
brew 'libogg'
brew 'libpng'
brew 'libtiff'
brew 'libtool'
brew 'libvorbis'
brew 'libyaml'
brew 'llvm'
brew 'node'
brew 'openssl'
brew 'p7zip'
brew 'pcre'
brew 'pgcli'
brew 'pkg-config'
brew 'postgres'
brew 'pyenv'
brew 'python'
brew 'readline'
brew 'rename'
brew 'restic'
brew 'ruby'
brew 'tree'
brew 'unrar'
brew 'wget'
brew 'xz'
brew 'yamllint'
brew 'zlib'
brew 'zsh'

# casks (taps at top)
cask 'atom'
cask 'authy'
cask 'dbeaver-community'
cask 'deluge'
cask 'docker'
cask 'firefox'
cask 'google-chrome'
cask 'inkscape'
cask 'iterm2'
cask 'java'
cask 'krita'
cask 'sketch'
cask 'spectacle'
cask 'vlc'

