#
# brew bundle
# brew bundle cleanup  # list. --force to remove.
#

### taps (casks at bottom)
tap 'homebrew/bundle'
tap 'homebrew/core'
tap 'homebrew/services'

### brews
brew 'ack'
brew 'aspell'  # lvx
brew 'autoconf'
brew 'autojump'
brew 'base64'
brew 'bison'  # semanticdb
brew 'boost'
brew 'cmake'
brew 'curl'
brew 'ffmpeg', args: ['with-libvpx', 'with-libvorbis']
brew 'flac'
brew 'flex'  # semanticdb
brew 'freetype'
brew 'fzf'
brew 'gdb'
brew 'gdbm'
brew 'gist'
brew 'git'
brew 'gpg'
brew 'hledger'  # lvx
brew 'hub'
brew 'id3lib'
brew 'imagemagick'
brew 'jpeg'
brew 'jq'
brew 'libogg'
brew 'libpng'
brew 'libtiff'
brew 'libtool'
brew 'libvorbis'
brew 'libyaml'
brew 'llvm'
brew 'neovim'
brew 'node@16' # lvx
brew 'openssl'
brew 'p7zip'
brew 'pcre'
brew 'pgcli'
brew 'pkg-config'
brew 'postgres'  # lvx
brew 'python'
brew 'readline'
brew 'rename'
brew 'restic'
brew 'tree'
brew 'up'
brew 'wget'
brew 'xz'
brew 'yamllint'
brew 'zlib'
brew 'zsh'

### casks (taps at top)
cask 'authy'
cask 'backblaze'
cask 'balenaetcher'
cask 'dbeaver-community'  # lvx
cask 'deluge'
cask 'figma'
cask 'firefox'
cask 'gimp'
cask 'google-chrome'
cask 'iterm2'
cask 'lastpass'
cask 'rar'
cask 'sketch'
cask 'spectacle'
cask 'vscodium'
cask 'vlc'
cask 'zoom'

