# brew bundle (cleanup --force)


# sources

tap 'homebrew/bundle'
tap 'homebrew/core'
tap 'homebrew/services'

tap 'homebrew/cask-fonts' # font-hack-nerd-font
tap 'nikitabobko/tap' # aerospace


# packages

## terminal

### art
brew 'd2' # diagram
brew 'freetype' # ? font

### audio
brew 'chromaprint' # fingerprint
brew 'ffmpeg', args: ['with-libvpx', 'with-libvorbis']
brew 'flac'
brew 'id3lib'
brew 'id3v2'
brew 'libogg'
brew 'libvorbis'

### compress
brew 'p7zip'
brew 'xz'
brew 'zlib'

### database
brew 'pgcli'
brew 'postgresql@14'

### format
brew 'shfmt'
brew 'tidy-html5'

### filesystem
brew 'ast-grep'
brew 'autojump'
brew 'fd'
brew 'rename'
brew 'ripgrep'
brew 'tree'

### image
brew 'imagemagick'
brew 'jpeg'
brew 'libpng'
brew 'libtiff'

### language
brew 'cmake'
brew 'go'
brew 'libyaml'
brew 'node'
brew 'python'
brew 'rustup'
brew 'zsh'

### lint
brew 'hadolint' # dockerfile
brew 'shellcheck'
brew 'vint' # vimscript
brew 'yamllint'

### misc
brew 'aspell' # spell
brew 'base64' # encoding
brew 'jless' # json
brew 'jq' # json
brew 'neovim' # editor

### package
brew 'antidote' # zsh
brew 'luarocks' # lua
brew 'pipx' # python

### pipes
brew 'fzf' # find
brew 'gnu-sed' # string
brew 'lolcat' # color
brew 'readline' # input
brew 'up' # interact

### security
brew 'gpg'
brew 'lastpass-cli'
brew 'openssl'

### source
brew 'gh'
brew 'gist'
brew 'git'
brew 'lazygit'
brew 'yadm' # dotfiles

### storage
brew 'e2fsprogs'
brew 'f3'

### toolchain
brew 'autoconf' # portability
brew 'bison' # parsing
brew 'boost' # helpers
brew 'flex' # tokenization
brew 'gdb' # debug
brew 'gdbm' # hashmap
brew 'libtool' # sharedlib
brew 'llvm' # infrastructure
brew 'pcre' # regex
brew 'pkgconf' # configuration

### web
brew 'curl'
brew 'wget'


## desktop

### art
cask 'amadine'
cask 'gimp'
cask 'pika' # contrast
cask 'sketch'

### audio
cask 'audacity'
cask 'kid3' # tag
cask 'plexamp'

### browser
cask 'firefox'
cask 'microsoft-edge'
cask 'ungoogled-chromium'

### development
cask 'dbeaver-community'
cask 'font-hack-nerd-font'
cask 'neovide'

### personal
cask 'authy'
cask 'hyperbackupexplorer'
cask 'lastpass'
#cask 'synology-note-station-client' # manual install to user apps

### system
cask 'aerospace'
cask 'balenaetcher'
cask 'rar'
#cask 'rectangle'

### terminal
cask 'ghostty'
cask 'iterm2'

### video
cask 'iina'
cask 'losslesscut'
cask 'plex'
cask 'vlc'
cask 'zoom'

### virtual
#cask 'android-studio'
#cask 'docker'

