# brew bundle
#   brew bundle cleanup --force

### taps (casks at bottom)
tap 'homebrew/bundle'
tap 'homebrew/core'
tap 'homebrew/services'
tap 'homebrew/cask-fonts'

### brews
brew 'aspell'
brew 'autoconf'
brew 'autojump'
brew 'base64'
brew 'bison'
brew 'boost'
brew 'cmake'
brew 'code-minimap'
brew 'curl'
brew 'e2fsprogs'
brew 'easy-tag'
brew 'fd'
brew 'ffmpeg', args: ['with-libvpx', 'with-libvorbis']
brew 'flac'
brew 'flex'
brew 'freetype'
brew 'fzf'
brew 'gdb'
brew 'gdbm'
brew 'gh'
brew 'gist'
brew 'git'
brew 'gnu-sed'
brew 'gpg'
brew 'hadolint'
brew 'id3lib'
brew 'imagemagick'
brew 'jless'
brew 'jpeg'
brew 'jq'
brew 'lastpass-cli'
brew 'libogg'
brew 'libpng'
brew 'libtiff'
brew 'libtool'
brew 'libvorbis'
brew 'libyaml'
brew 'llvm'
brew 'luarocks'
brew 'neovim'
brew 'nvm'
brew 'openssl'
brew 'p7zip'
brew 'pcre'
brew 'pgcli'
brew 'pkg-config'
brew 'postgresql@14'
brew 'python'
brew 'readline'
brew 'rename'
brew 'ripgrep'
brew 'rustup-init'
brew 'shellcheck'
brew 'shfmt'
brew 'tidy-html5'
brew 'tree'
brew 'up'
brew 'vint'
brew 'wget'
brew 'xz'
brew 'yamllint'
brew 'zlib'
brew 'zsh'

### casks (taps at top)
cask 'audacity'
cask 'authy' # 2FA
cask 'balenaetcher' # USB image
cask 'dbeaver-community' # SQL UI
#cask 'docker'
cask 'firefox'
cask 'font-hack-nerd-font' # LunarVim
cask 'gimp'
cask 'google-chrome'
cask 'iterm2'
cask 'jubler' # Subtitles
cask 'lastpass'
cask 'logseq'
cask 'obsidian'
cask 'pika' # WCAG Contrast
cask 'rar'
cask 'rectangle' # Window Manager
cask 'sketch'
cask 'vlc'
cask 'zoom'
