# brew bundle
#   brew bundle cleanup --force

### taps (casks at bottom)
tap 'homebrew/bundle'
tap 'homebrew/core'
tap 'homebrew/services'
tap 'homebrew/cask-fonts'

### brews
brew 'aspell'
brew 'ast-grep'
brew 'autoconf'
brew 'autojump'
brew 'base64'
brew 'bison'
brew 'boost'
brew 'chromaprint'
brew 'cmake'
brew 'code-minimap'
brew 'curl'
brew 'e2fsprogs'
brew 'easy-tag'
brew 'f3'
brew 'fd'
brew 'ffmpeg', args: ['with-libvpx', 'with-libvorbis']
brew 'flac'
brew 'flex'
brew 'freetype'
brew 'fzf'
brew 'gdb'
brew 'gdbm'
brew 'gh'
brew 'gist'
brew 'git'
brew 'gnu-sed'
brew 'go'
brew 'gpg'
brew 'hadolint'
brew 'id3lib'
brew 'id3v2'
brew 'imagemagick'
brew 'jless'
brew 'jpeg'
brew 'jq'
brew 'lastpass-cli'
brew 'lazygit'
brew 'libogg'
brew 'libpng'
brew 'libtiff'
brew 'libtool'
brew 'libvorbis'
brew 'libyaml'
brew 'llvm'
brew 'lolcat'
brew 'luarocks'
brew 'neovim'
brew 'node'
brew 'openssl'
brew 'p7zip'
brew 'pcre'
brew 'pgcli'
brew 'pkg-config'
brew 'postgresql@14'
brew 'python'
brew 'readline'
brew 'rename'
brew 'ripgrep'
brew 'rustup'
brew 'shellcheck'
brew 'shfmt'
brew 'tidy-html5'
brew 'tree'
brew 'up'
brew 'vint'
brew 'wget'
brew 'xz'
brew 'yamllint'
brew 'zlib'
brew 'zsh'

### casks (taps at top)
cask 'android-studio'
cask 'audacity'
cask 'authy'
cask 'balenaetcher'
cask 'dbeaver-community'
#cask 'docker'
cask 'eloston-chromium'
cask 'firefox'
cask 'font-hack-nerd-font'
cask 'gimp'
cask 'hyperbackupexplorer'
cask 'iina'
cask 'iterm2'
cask 'jubler' # subtitles
cask 'lastpass'
cask 'logseq'
cask 'losslesscut'
cask 'microsoft-edge'
cask 'obsidian'
cask 'pika' # contrast
cask 'plex'
cask 'plexamp'
cask 'rar'
cask 'rectangle'
cask 'sketch'
cask 'syncthing'
cask 'vmware-fusion'
cask 'zoom'
